
## 🏗️ Terraform Plan Results

<details>
<summary>📋 Click to expand plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_artifact_registry_repository.standard_repo will be created
  + resource "google_artifact_registry_repository" "standard_repo" {
      + create_time      = (known after apply)
      + description      = "Standard Docker repository for Death Star project images"
      + effective_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + format           = "DOCKER"
      + id               = (known after apply)
      + location         = "us-central1"
      + mode             = "STANDARD_REPOSITORY"
      + name             = (known after apply)
      + project          = "death-star-platform-666"
      + repository_id    = "death-star-images"
      + terraform_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time      = (known after apply)

      + vulnerability_scanning_config (known after apply)
    }

  # google_cloud_run_v2_service.bridge_ui will be created
  + resource "google_cloud_run_v2_service" "bridge_ui" {
      + conditions              = (known after apply)
      + create_time             = (known after apply)
      + creator                 = (known after apply)
      + delete_time             = (known after apply)
      + deletion_protection     = false
      + effective_annotations   = (known after apply)
      + effective_labels        = {
          + "goog-terraform-provisioned" = "true"
        }
      + etag                    = (known after apply)
      + expire_time             = (known after apply)
      + generation              = (known after apply)
      + id                      = (known after apply)
      + ingress                 = (known after apply)
      + last_modifier           = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = (known after apply)
      + location                = "us-central1"
      + name                    = "bridge-ui"
      + observed_generation     = (known after apply)
      + project                 = "death-star-platform-666"
      + reconciling             = (known after apply)
      + terminal_condition      = (known after apply)
      + terraform_labels        = {
          + "goog-terraform-provisioned" = "true"
        }
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + update_time             = (known after apply)
      + uri                     = (known after apply)
      + urls                    = (known after apply)

      + template {
          + max_instance_request_concurrency = (known after apply)
          + service_account                  = (known after apply)
          + timeout                          = (known after apply)

          + containers {
              + build_info = (known after apply)
              + image      = "us-central1-docker.pkg.dev/death-star-platform-666/death-star-images/death-star-bridge-ui:67a0f66e0cf229f1f851eadc02251c58b2f7ac97"

              + env {
                  + name  = "NEXT_PUBLIC_BFF_URL"
                  + value = (known after apply)
                }

              + ports {
                  + container_port = 3000
                  + name           = (known after apply)
                }

              + resources (known after apply)

              + startup_probe (known after apply)
            }

          + scaling {
              + max_instance_count = 10
              + min_instance_count = 0
            }
        }

      + traffic {
          + percent = 100
          + type    = "TRAFFIC_TARGET_ALLOCATION_TYPE_LATEST"
        }
    }

  # google_cloud_run_v2_service.command_core will be created
  + resource "google_cloud_run_v2_service" "command_core" {
      + conditions              = (known after apply)
      + create_time             = (known after apply)
      + creator                 = (known after apply)
      + delete_time             = (known after apply)
      + deletion_protection     = false
      + effective_annotations   = (known after apply)
      + effective_labels        = {
          + "goog-terraform-provisioned" = "true"
        }
      + etag                    = (known after apply)
      + expire_time             = (known after apply)
      + generation              = (known after apply)
      + id                      = (known after apply)
      + ingress                 = (known after apply)
      + last_modifier           = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = (known after apply)
      + location                = "us-central1"
      + name                    = "command-core"
      + observed_generation     = (known after apply)
      + project                 = "death-star-platform-666"
      + reconciling             = (known after apply)
      + terminal_condition      = (known after apply)
      + terraform_labels        = {
          + "goog-terraform-provisioned" = "true"
        }
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + update_time             = (known after apply)
      + uri                     = (known after apply)
      + urls                    = (known after apply)

      + template {
          + max_instance_request_concurrency = (known after apply)
          + service_account                  = (known after apply)
          + timeout                          = (known after apply)

          + containers {
              + build_info = (known after apply)
              + image      = "us-central1-docker.pkg.dev/death-star-platform-666/death-star-images/death-star-command-core:2f5442a003c727593b67f9ad52231d9948146465"

              + env {
                  + name  = "FF_HEALTH_ENDPOINT"
                  + value = "true"
                }

              + ports {
                  + container_port = 8080
                  + name           = (known after apply)
                }

              + resources (known after apply)

              + startup_probe (known after apply)
            }

          + scaling {
              + max_instance_count = 10
              + min_instance_count = 0
            }
        }

      + traffic {
          + percent = 100
          + type    = "TRAFFIC_TARGET_ALLOCATION_TYPE_LATEST"
        }
    }

  # google_cloud_run_v2_service_iam_binding.bridge_ui_public_access will be created
  + resource "google_cloud_run_v2_service_iam_binding" "bridge_ui_public_access" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "us-central1"
      + members  = [
          + "allUsers",
        ]
      + name     = "bridge-ui"
      + project  = "death-star-platform-666"
      + role     = "roles/run.invoker"
    }

  # google_cloud_run_v2_service_iam_binding.command_core_public_access will be created
  + resource "google_cloud_run_v2_service_iam_binding" "command_core_public_access" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "us-central1"
      + members  = [
          + "allUsers",
        ]
      + name     = "command-core"
      + project  = "death-star-platform-666"
      + role     = "roles/run.invoker"
    }

  # google_compute_network.vpc_network will be created
  + resource "google_compute_network" "vpc_network" {
      + auto_create_subnetworks                   = false
      + bgp_always_compare_med                    = (known after apply)
      + bgp_best_path_selection_mode              = (known after apply)
      + bgp_inter_region_cost                     = (known after apply)
      + delete_default_routes_on_create           = false
      + gateway_ipv4                              = (known after apply)
      + id                                        = (known after apply)
      + internal_ipv6_range                       = (known after apply)
      + mtu                                       = (known after apply)
      + name                                      = "death-star-vpc"
      + network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
      + network_id                                = (known after apply)
      + numeric_id                                = (known after apply)
      + project                                   = "death-star-platform-666"
      + routing_mode                              = (known after apply)
      + self_link                                 = (known after apply)
    }

  # google_compute_subnetwork.main_subnet will be created
  + resource "google_compute_subnetwork" "main_subnet" {
      + creation_timestamp         = (known after apply)
      + enable_flow_logs           = (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + internal_ipv6_prefix       = (known after apply)
      + ip_cidr_range              = "10.0.0.0/24"
      + ipv6_cidr_range            = (known after apply)
      + ipv6_gce_endpoint          = (known after apply)
      + name                       = "death-star-main-subnet"
      + network                    = (known after apply)
      + private_ip_google_access   = (known after apply)
      + private_ipv6_google_access = (known after apply)
      + project                    = "death-star-platform-666"
      + purpose                    = (known after apply)
      + region                     = "us-central1"
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)
      + state                      = (known after apply)
      + subnetwork_id              = (known after apply)

      + secondary_ip_range (known after apply)
    }

Plan: 7 to add, 0 to change, 0 to destroy.
```

</details>

**Triggered by**: simaopgt
**Commit**: 1384760092f5b93c884cad0d226e80b836879af8
